In [1]:
import pandas as pd

<div style="color: blue; font-size: 20px; text-align: center;">2 Main Data-types</div>

<div style="color: blue; font-size: 20px; text-align: center;">1) Series</div>

In [9]:
cars = pd.Series(["BMW","Honda","Skoda"])

In [10]:
cars

0      BMW
1    Honda
2    Skoda
dtype: object

In [11]:
colours = pd.Series(["Red","Green","Blue"])

In [12]:
colours

0      Red
1    Green
2     Blue
dtype: object

<div style="color: blue; font-size: 20px; text-align: center;">2) DataFrames</div>

In [13]:
cars_data = pd.DataFrame({"car make":cars,"colour":colours})

In [14]:
cars_data

  car make colour
0      BMW    Red
1    Honda  Green
2    Skoda   Blue

<div style="color: blue; font-size: 20px; text-align: center;">Import-Data</div>

In [17]:
carsales_data = pd.read_csv("car-sales.csv")

In [21]:
carsales_data

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00